Show / Hide Table of Contents
Class MatPrestressSteel
Material prestressing steel base class
Inheritance
System.Object
OpenObject
OpenElementId
Material
MatPrestressSteel
MatPrestressSteelEc2
MatPrestressSteelSIA
Inherited Members
 Material.Name
 Material.LoadFromLibrary
 Material.E
 Material.G
 Material.Poisson
 Material.UnitMass
 Material.SpecificHeat
 Material.ThermalExpansion
 Material.ThermalConductivity
 Material.IsDefaultMaterial
 Material.OrderInCode
 Material.StateOfThermalExpansion
 Material.StateOfThermalConductivity
 Material.StateOfThermalSpecificHeat
 Material.StateOfThermalStressStrain
 Material.StateOfThermalStrain
 Material.UserThermalSpecificHeatCurvature
 Material.UserThermalConductivityCurvature
 Material.UserThermalExpansionCurvature
 Material.UserThermalStrainCurvature
 Material.UserThermalStressStrainCurvature
 OpenElementId.Id
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Material
Assembly: IdeaRS.OpenModel.dll
Syntax
public abstract class MatPrestressSteel : Material
Properties
Improve this Doc   View Source
Area
Area
Declaration
public double Area { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
Diameter
Diameter
Declaration
public double Diameter { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
EquivalentDiameter
Equivalent diameter
Declaration
public double EquivalentDiameter { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
NumberOfWires
number of wires in strand
Declaration
public int NumberOfWires { get; set; }
Property Value
 Type |  Description
 System.Int32
 Improve this Doc
 View Source